# command line utils
brew "zoxide"
brew "eza"
brew "fzf"
brew "ripgrep"
brew "stow"

# neovim + dependencies
brew "luarocks"
brew "fd"
brew "wget"
brew "neovim"

# terminal eyecandy
brew "fastfetch"
brew "starship"

# terminal dev tools
brew "container"
brew "lazygit"
brew "btop"
brew "yazi"
brew "mise"
brew "pnpm"
cask "ghostty"

# terminal code agents
brew "anomalyco/tap/opencode"
cask "claude-code"
cask "codex"

# dev tools
cask "zed"
cask "visual-studio-code"
cask "figma"
cask "stats"

# home lab
brew "syncthing"
cask "tailscale-app"

# productivity
cask "obsidian"
cask "spotify"

# LLM providers
cask "chatgpt"
cask "claude"

# browsers
cask "firefox"
cask "google-chrome"

# social
cask "discord"
cask "telegram"
cask "whatsapp"
